Table of Contents
 Class Taper
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Defines haunches (variyng cross-sections) along the member.
One Taper may be assigned to multiple Members. Sections of the member not covered by a span will use the member's cross-section.
[OpenModelClass("CI.StructModel.Structure.MemberTapered,CI.StructuralElements", "CI.StructModel.Structure.IMemberTapered,CI.BasicTypes")]
public class Taper : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Taper
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Spans
List of spans. Spans mut not overlap.
public List<ReferenceElement> Spans { get; set; }
Property Value
List<ReferenceElement>
 Edit this page